day26/awesome_answers_july_2016-master/app/controllers/questions_controller.rb

SELECT  "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "questions"
---
  def index
    @questions = Question.order(created_at: :desc).
                          page(params[:page]).
                          per(QUESTIONS_PER_PAGE)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_question
    @question = Question.find params[:id]